tanke = ['苏烈','刘邦','钟馗','牛魔','程咬金','白起','刘婵','庄周','项羽','廉颇','巨灵神','安禄山','猪八戒']

zhanshi = ['狂铁','裴擒虎','凯','孙悟空','哪吒','杨戬','橘右京','亚瑟','雅典娜','夏侯惇','关羽','吕布','韩信','老夫子','达摩','典韦','曹操','钟无艳','墨子','赵云','刑天','龙且']

cike = ['百里玄策','庞统','花木兰','阿珂','不知火舞','李白','娜可露露','兰陵王','露娜','韩信','宫本武藏','盖聂','红拂']

fashi = ['杨玉环','奕星','女娲','周瑜','鬼谷子','芈月','干将莫邪','东皇太一','大乔','诸葛亮','貂蝉','张良','安其拉','不知火舞','姜子牙','武则天','王昭君','甄姬','扁鹊','高渐离','嬴政','妲己','小乔']

sheshou = ['公孙离','百里守约','后裔','刘备','马可波罗','成吉思汗','虞姬','李元芳','艾琳','狄仁杰','鲁班七号','孙尚香']

fuzhu = ['明世隐','梦琪','孙斌','太乙真人','蔡文姬']

print('"王者荣耀"游戏角色')
print("====坦克:====")
for i in tanke:
    print(i,end = ' ')
print("")

print("====战士:====")
for i in zhanshi:
    print(i,end = '')
print("")

print("====刺客:====")
for i in cike:
    print(i,end = ' ')
print("")

print("====法师:====")
for i in fashi:
    print(i,end = ' ')
print("")

print("====射手:====")
for i in sheshou:
    print(i,end = ' ')
print("")

print("====辅助:====")
for i in fuzhu:
    print(i,end = "")



