用户a = input("请输入你的名字：")
1 = '水瓶座,1月20~2月18，请输入1'
2 = '双鱼座,2月19~3月20，请输入2'
3 = '白羊座,3月21~4月19，请输入3'
4 = '金牛座,4月20~5月20，请输入4'
5 = '双子座,5月21~6月21，请输入5'
6 = '巨蟹座,6月21~7月22，请输入6'
7 = '狮子座,7月23~8月22，请输入7'
8 = '处女座,8月23~9月22，请输入8'
print("水瓶座请输入%s" % 1 %2 %3 % 4 % 5 % 6  % 7 % 8)
9 = '请根据如上提示选择对应编号(例如,水瓶座请输入:1)'
print('%s' % 9)
a = '水瓶座,1月20~2月18'
b = '双鱼座,2月19~3月20'
c = '白羊座,3月21~4月19'
d = '金牛座,4月20~5月20'
e = '双子座,5月21~6月21'
f = '巨蟹座,6月21~7月22'
g = '狮子座,7月23~8月22'
h = '处女座,8月23~9月22'
用户a = int(input() 
print(用户a)
